
$(function(){
	$('#char_line').highcharts({
		//全局设置
		title: {
        text: '优酷视频播放量',
        x: -20
    },
    subtitle: {
        text: '数据来源: youku.com',
        x: -20
    },
    xAxis: {
        categories: ['6-15', '6-16 0点', '6-16 12点', '6-17', '6-19', '6-20 0点', '6-20 12点', '6-21', '6-22', '6-23 0点', '6-23 12点', '6-24', '6-25 0点', '6-25 12点', '6-26 0点', '6-26 12点', '6-27', '6-28 0点', '6-28 12点']
    },
    yAxis: {
        title: {
            text: '播放量'
        },
        plotLines: [{
            value: 0,
            width: 1,
            color: '#808080'
        }]
    },
    tooltip: {
        valueSuffix: ''
    },
    legend: {
        layout: 'vertical',
        align: 'right',
        verticalAlign: 'middle',
        borderWidth: 0
    },
    series: [{
        name: '高博文',
        data: [121892, 120981, 120981, 120985, 125202, 105896, 124683 ,124684 ,155069 ,140979 ,156774 ,156776 ,126685, 157236, 141469, 161472, 161476, 130928, 158578]
    },
    {
        name: '包一峰',
        data: [746064, 161 ,744736 ,744736 ,744233 ,744233 ,744233 ,744233 ,743337 ,743337 ,743337 ,743337 ,163, 741432, 741432, 741432, 741432, 164, 164]
    }
    ]
	});
});